int main()
{
	// Арифметически

	// + - * /     ^    %       //


	// СИ++ + - * / %

	int a = 7;
	int b = 3;

	int c = a / b; // 2

	c = a % b; // c =    a =    (a/b)*b = 1

	c = b - a;

	unsigned int uc = b - a;

	a = 1000000000;

	b = 1'000'000'000;

	a = 1e9;


	c = a * b;

	a = 10;

	b = 3;


	a / b;

	float fl = a / b; // 3.00000000000

	float fa = a;

	fl = fa / b; // 3.333333333325

	char ch = 'a'; // ascii code



	ch = ch + ch;

	ch = 97 + 97;


	int aa = 5;

	aa = aa + aa;


	//Логические

	//  < > == ,<= >=  !   !=
	// && И
	// 1 1 -> 1
	// 1 0 -> 0
	// 0 1 -> 0
	// 0 0 -> 0
	// 
	// 
	// 
	// || ИЛИ
	// 0 0 -> 0
	// 1 0 -> 1
	// 0 1 -> 1
	// 1 1 -> 1

	(4 < 5) && (7 < 8) == 1;

	bool bl1 = (4 < 5) && (7 < 8);

	(3 && 4) == 1;

	bool bl2 = (3 && 0);

	// -23 2323 -> 1
	//0 -> 0











}

